Repository: requnix/Ruby.mode
Catalog: Contents/Resources/*.lproj/Localizable.strings
Languages: dutch, german

source: Attribute Definitions
dutch: Attribuutdefinities
german: Attributdefinitionen

source: Definitions
dutch: Definities
german: Definitionen

source: Keywords
dutch: Sleutelwoorden
german: Schlüsselwörter

source: Builtin Functions
dutch: Ingebouwde functies
german: Eingebaute Funktionen

source: Builtin Globals
dutch: Ingebouwde globalen
german: Eingebaute Globals

source: Builtin Classes
dutch: Ingebouwde klassen
german: Eingebaute Classes

source: Symbols
dutch: :symbolen
german: :symbole

source: Numbers
dutch: Nummers
german: Zahlen

source: Instance Variables
dutch: Instantie variabelen
german: Instanzvariablen

source: Class Variables
dutch: Klasse-variabelen
german: Klassenvariablen

source: Global Variables
dutch: Globale variabelen
german: globale Variablen

source: String with double quotes
dutch: "Strings"
german: "Zeichenketten"

source: Embedded Expression
dutch: #{Ingevoegde Expressies}
german: Eingebettete Ausdrücke

source: String with single quotes
dutch: 'Strings'
german: 'Zeichenketten'

source: Backticks
dutch: `Back-quotes`

source: Singleline Comment
dutch: # Commentaar
german: # Kommentar

source: Regexp
dutch: Reguliere expressie
german: Reguläre Ausdrücke

source: POD Comments
dutch: POD-commentaar
german: POD Kommentare

source: Tags
dutch: HTML-tags
german: HTML Tags

source: Attributes
dutch: HTML-attributen
german: HTML Attribute

source: Strings
dutch: HTML-strings
german: HTML Zeichenketten

source: ERB Delimiter
dutch: <%ERB Scheidingsteken%>

source: HTMLComment
dutch: <!-- commentaar -->
german: <!-- Kommentar -->

source: Heredoc
dutch: >>HEREDOC String
german: >>HEREDOC Zeichenketten

source: Hexadecimal Characters
dutch: Hexadecimale tekens
german: Hexadezimale Zeichen

source: Strings with percent Q
dutch: %Q/Strings/
german: %Q/Zeichenketten/

source: Literals
german: Literale
